
&НаКлиенте
Процедура АнализГрафика(Команда)
	
	СписокОтпусков = ПоместитьОтпускаСотрудниковВременноеХранилище();	
	ВыбранноеЗначение = Новый Структура();
    ВыбранноеЗначение.Вставить("СписокОтпусков", СписокОтпусков );
    
	
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ВыбранноеЗначение, Элементы.ОтпускаСотрудников,
	 , , , , );
	
	
	
КонецПроцедуры


&НаСервере
Функция ПоместитьОтпускаСотрудниковВременноеХранилище()
	
	ТабОтпускаСотрудников = Объект.ОтпускаСотрудников.Выгрузить();
	
		
 АдресВХ = ПоместитьВоВременноеХранилище(ТабОтпускаСотрудников, УникальныйИдентификатор);
 
Возврат АдресВХ

КонецФункции

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	
	СколькоДнейОтпуска = (ТекДанные.ДатаОкончания - ТекДанные.ДатаНачала) / 86400;
	
	ТекДанные.КоличествоДнейОтпуска = СколькоДнейОтпуска;
	
	
КонецПроцедуры

