#Область ПрограммныйИнтерфейс

Функция СтрокаJSON(ОбъектJSON) Экспорт

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб, , , , , , , );

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);

	Возврат Запись.Закрыть();

КонецФункции

Функция ОтветJSON(Объект, КодСостояния = 200) Экспорт

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Объект));
	Ответ.Заголовки.Вставить("Content-Type", "application/json");

	Возврат Ответ;
КонецФункции

Процедура ПолучитьЭлементСправочника() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_УведомленияТелеграмБоту.Ссылка,
				   |	ВКМ_УведомленияТелеграмБоту.Текст
				   |ИЗ
				   |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтветПривет =ВКМ_Телеграм.ВКМ_ОтправкаСообщенийВТелеграм(Выборка.Текст);
		Если ОтветПривет = 200 Тогда

			ЭлементсправочникаУдаление = Выборка.Ссылка.ПолучитьОбъект();
			ЭлементсправочникаУдаление.Удалить();
		Иначе
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ВКМ_ОтправкаСообщенийВТелеграм(РезультатТекст) Экспорт

	SSL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows,
		Новый СертификатыУдостоверяющихЦентровWindows);
	Соединение = Новый HTTPСоединение("api.telegram.org", , , , , , SSL);

	ТокенБотаТелеграм = Константы.ВКМ_ТокенТелеграмБота.Получить();
	ЗапросТокенБот = СтрШаблон("/bot%1/sendMessage", ТокенБотаТелеграм);

	Запрос =  Новый HTTPЗапрос(ЗапросТокенБот);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");

	ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();
	Результат = Новый Структура;

	Результат.Вставить("chat_id", ИдентификаторЧата);
	Результат.Вставить("text", РезультатТекст);

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб, , , , , , , );

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, Результат);

	СтрокаДляЗаписи = Запись.Закрыть();

	Запрос.УстановитьТелоИзСтроки(СтрокаДляЗаписи);
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	ОтветОтСервера = Ответ.ПолучитьТелоКакСтроку();
	РезультатОтвета =Ответ.КодСостояния;

	Возврат РезультатОтвета;
КонецФункции
Функция ОтветОбОшибке(ИнформацияОбОшибке) Экспорт

	ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(
		ИнформацияОбОшибке));
КонецФункции
#КонецОбласти