&НаКлиенте
Процедура ЗаполнитьАкты(Команда)

	Объект.СписокДокументов.Очистить();
	ДлительнаяОперацияАкты = ВыполнитьДлительнуюОперациюАктыНаСервере();

	ОповещенияОперации = Новый ОписаниеОповещения("ФункцияВыполнена", ЭтотОбъект);

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияАкты, ОповещенияОперации, );

КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительнуюОперациюАктыНаСервере()

	ДлительнаяОперацияАктов = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"ВКМ_ДлительнаяОперацияСозданияАктов.МассовоеСозданиеАктовСервер", , , , , , , );

	Возврат ДлительнаяОперацияАктов;
КонецФункции

&НаКлиенте
Процедура ФункцияВыполнена(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	СозданиеДокумента(Результат.АдресРезультата);
КонецПроцедуры

&НаСервере
Процедура СозданиеДокумента(РезультатАдрес)

	РезультатОперации = ПолучитьИзВременногоХранилища(РезультатАдрес);
	Для Каждого Строка Из РезультатОперации Цикл
		НовСтрока = Объект.СписокДокументов.добавить();
		НовСтрока.Договор = Строка.Договор;
		НовСтрока.Реализация = Строка.Ссылка;
	КонецЦикла;
КонецПроцедуры