&НаКлиенте
Процедура ЗаполнитьАкты(Команда)

	Объект.СписокДокументов.Очистить();
	ДлительнаяОперацияАкты = ВыполнитьДлительнуюОперациюАктыНаСервере();

	ОповещенияОперации = Новый ОписаниеОповещения("ФункцияВыполнена", ЭтотОбъект);

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияАкты, ОповещенияОперации, );

КонецПроцедуры

&НаСервере
Функция ВыполнитьДлительнуюОперациюАктыНаСервере()

	ДлительнаяОперацияАктов = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"ВКМ_ДлительнаяОперацияСозданияАктов.МассовоеСозданиеАктовСервер", , , , , , , );

	Возврат ДлительнаяОперацияАктов;
КонецФункции

&НаКлиенте
Процедура ФункцияВыполнена(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	СозданиеДокумента(Результат.АдресРезультата);
КонецПроцедуры

&НаСервере
Процедура СозданиеДокумента(РезультатАдрес)
	РезультатОперации = ПолучитьИзВременногоХранилища(РезультатАдрес);
	Выборка = РезультатОперации.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.Договор = Выборка.СсылкаДоговор;
			НовыйДокумент.Организация = Выборка.Организация;
			НовыйДокумент.Контрагент = Выборка.Контрагент;
			НовыйДокумент.Комментарий = "Документ создан автоматически";

			НовыйДокумент.Записать();

			НовыйДокумент.ВыполнитьАвтозаполнение();
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			
			НовСтрока = Объект.СписокДокументов.добавить();
			НовСтрока.Договор = НовыйДокумент.Договор;
			НовСтрока.Реализация = НовыйДокумент.Ссылка;
		Иначе
			НовСтрока = Объект.СписокДокументов.добавить();
			НовСтрока.Договор = Выборка.Договор;
			НовСтрока.Реализация = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры