
&НаКлиенте
Процедура СуммаКВыплате(Команда)
	СуммаКВыплатеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СуммаКВыплатеНаСервере()
	Объект.Выплаты.Очистить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтр = Объект.Выплаты.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаДетальныеЗаписи);
	НоваяСтр.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	

	
	
КонецПроцедуры
