Функция МассовоеСозданиеАктовСервер() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец
	|ПОМЕСТИТЬ ВТ_ДоговораАбонент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговораАбонент.ВидДоговора КАК ВидДоговора,
	|	ВТ_ДоговораАбонент.Наименование КАК Наименование,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	ВТ_ДоговораАбонент.Организация КАК Организация,
	|	ВТ_ДоговораАбонент.Ссылка КАК СсылкаДоговор,
	|	ВТ_ДоговораАбонент.Владелец КАК Контрагент
	|ИЗ
	|	ВТ_ДоговораАбонент КАК ВТ_ДоговораАбонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ВТ_ДоговораАбонент.Наименование = РеализацияТоваровУслуг.Договор.Наименование)";

	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);

	РезультатЗапроса = Запрос.Выполнить();
	
	//попытка доработки
	
	Выборка = РезультатЗапроса.Выбрать();
	СтрокиДляДобавления = Новый Массив;

	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.Договор = Выборка.СсылкаДоговор;
			НовыйДокумент.Организация = Выборка.Организация;
			НовыйДокумент.Контрагент = Выборка.Контрагент;
			НовыйДокумент.Комментарий = "Документ создан автоматически";

			НовыйДокумент.Записать();

			НовыйДокумент.ВыполнитьАвтозаполнение();
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			
			СтрокиДляДобавления.Добавить(НовыйДокумент);

		Иначе
			ДокументДляЗаписи = Выборка.Ссылка;
			СтрокиДляДобавления.Добавить(ДокументДляЗаписи);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокиДляДобавления;
КонецФункции