Процедура ЗаполнениеДокументаРеализация(ЭтотОбъект)Экспорт
	

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор = &Договор";

	Запрос.УстановитьПараметр("Договор", ЭтотОбъект.Договор);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();

	Если Выборка.СуммаАбонентскойПлаты <> 0 Тогда

		Товары = ЭтотОбъект.Товары;

		Товары.Очистить();

		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
		НоваяСтрока.Количество = "1";
		НоваяСтрока.Цена = Выборка.СуммаАбонентскойПлаты;
		НоваяСтрока.Сумма = Выборка.СуммаАбонентскойПлаты;

	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_КоличествоЧасовОборот, 0) КАК КоличествоЧасов,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_СуммаКОплатеОборот, 0) КАК СуммаКОплате,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_Договор КАК Договор
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода,,) КАК
	|		ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО (ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_Клиент = РеализацияТоваровУслуг.Контрагент)
	|		И (ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_Договор = РеализацияТоваровУслуг.Договор)
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор = &Договор";
	
	ДатаНачала = НачалоМесяца(ЭтотОбъект.Дата);
	ДатаОкончания = КонецМесяца(ЭтотОбъект.Дата);
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала );
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания );

	Запрос.УстановитьПараметр("Договор", ЭтотОбъект.Договор);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Выборка.Следующий();
	
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Выборка.СуммаКОплате <> Неопределено Тогда
		
		Услуги  = ЭтотОбъект.Услуги;
		Услуги.Очистить();
		
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Количество = Выборка.КоличествоЧасов;
		новаяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
		НоваяСтрока.Сумма = Выборка.СуммаКОплате;
		НоваяСтрока.Цена = Выборка.СуммаКОплате / Выборка.КоличествоЧасов;
		
	КонецЕсли;
	
	КонецПроцедуры