
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда	
		ВКМ_СозданиеЭлементов();
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда	
		ВКМ_СозданиеЭлементов();
КонецЕсли;
КонецПроцедуры
//++ВКМ_Добавление элементов на форму

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ПриИзмененииДоговораНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДоговораНаСервере()
	

		ВКМ_СозданиеЭлементов();

	
КонецПроцедуры

&НаСервере
Процедура ВКМ_СозданиеЭлементов()

	//Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	Если Элементы.Найти("ДополнительныеРеквизиты") = Неопределено Тогда
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			ГруппаДополнительныеРеквизиты = Элементы.Добавить("ДополнительныеРеквизиты", Тип("ГруппаФормы"), ЭтаФорма);
			ГруппаДополнительныеРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДополнительныеРеквизиты.Заголовок = "Дополнительные реквизиты";
			ГруппаДополнительныеРеквизиты.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			ГруппаДополнительныеРеквизиты.ОтображатьЗаголовок = Истина;
			ГруппаДополнительныеРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

			ГруппаДополнительныеРеквизиты2 = Элементы.Добавить("ГруппаЭлементовДата", Тип("ГруппаФормы"),
				Элементы.ДополнительныеРеквизиты);
			ГруппаДополнительныеРеквизиты2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДополнительныеРеквизиты2.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаДополнительныеРеквизиты2.ОтображатьЗаголовок = Ложь;
			ГруппаДополнительныеРеквизиты2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

			ГруппаДополнительныеРеквизиты3 = Элементы.Добавить("ГруппаЭлементовСумма", Тип("ГруппаФормы"),
				Элементы.ДополнительныеРеквизиты);
			ГруппаДополнительныеРеквизиты3.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДополнительныеРеквизиты3.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаДополнительныеРеквизиты3.ОтображатьЗаголовок = Ложь;
			ГруппаДополнительныеРеквизиты3.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НовыйЭлемент = Элементы.Добавить("НачалоПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаЭлементовДата);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоПериодаДействия";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;

			НовыйЭлемент2 = Элементы.Добавить("КонецПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаЭлементовДата);
			НовыйЭлемент2.ПутьКДанным = "Объект.ВКМ_КонецПериодаДействия";
			НовыйЭлемент2.Вид = ВидПоляФормы.ПолеВвода;

			НовыйЭлемент3 = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Элементы.ГруппаЭлементовСумма);
			НовыйЭлемент3.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			НовыйЭлемент3.Вид = ВидПоляФормы.ПолеВвода;

			НовыйЭлемент4 = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Элементы.ГруппаЭлементовСумма);
			НовыйЭлемент4.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
			НовыйЭлемент4.Вид = ВидПоляФормы.ПолеВвода;

		КонецЕсли;
		
		
		
	КонецЕсли;
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Если Элементы.Найти("ДополнительныеРеквизиты") <> Неопределено Тогда
			Элементы.ДополнительныеРеквизиты.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Если Элементы.Найти("ДополнительныеРеквизиты") <> Неопределено Тогда
			Элементы.ДополнительныеРеквизиты.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//--ВКМ_Добавление элементов на форму
