
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвиженияПоПремии();
	
	СформироватьДвиженияПоУдержанию();
	
	СформироватьДвижениеВРегистрВзаиморасчеты();
		
КонецПроцедуры

Процедура СформироватьДвиженияПоПремии()
	
	
	БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(Дата), -12);

	БазовыйПериодКонец = НачалоМесяца(Дата) - 1;
	
	Для Каждого Стр Из СписокСотрудников Цикл
		
	Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
	
	Движение.Сотрудник = Стр.Сотрудник;
	Движение.Результат = Стр.СуммаПремии;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
	Движение.ПериодРегистрации = НачалоМесяца(Дата);
	Движение.БазовыйПериодНачало = БазовыйПериодНачало;
	Движение.БазовыйПериодКонец = БазовыйПериодКонец;
	Движение.Регистратор = Ссылка;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияПоУдержанию()
	
	Для Каждого Строка из СписокСотрудников Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Налог;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
        Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Регистратор = Ссылка;
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Результат,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, &Разрез,
		|		Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения); 
	
	Разрез = Новый Массив;
	Разрез.Добавить("Регистратор");
	
	Запрос.УстановитьПараметр("Разрез", Разрез);
   
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		Движение.Результат = Выборка.РезультатБаза * 13 /100;
	КонецЦикла;

     Движения.ВКМ_Удержания.Записать(, Истина);
	
КонецПроцедуры

Процедура СформироватьДвижениеВРегистрВзаиморасчеты()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК ПремияФикс,
		|	СУММА(ВКМ_Удержания.Результат) КАК НалогФикс
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО (ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_Удержания.Сотрудник)
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор
		|	И ВКМ_Удержания.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник,
		|	ВКМ_Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Сумма = Выборка.ПремияФикс - Выборка.НалогФикс;
		Движение.Сотрудник = Выборка.Сотрудник;
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

