
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПростоСтрока = ПолучитьИзВременногоХранилища(Параметры.СписокОтпусков);
    Реквизит1.Загрузить(ПростоСтрока);

КонецПроцедуры



&НаКлиенте
Процедура Сформировать(Команда)

	//Строка = ПолучитьИзВременногоХранилища(Параметры.АдресВХ);
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
	Для Каждого Стр Из Реквизит1 Цикл
	Точка = ДиаграммаГанта.УстановитьТочку(Стр.Сотрудник);
	Серия = ДиаграммаГанта.УстановитьСерию(Стр.КоличествоДнейОтпуска);
	ЗначениеДГ = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
	
	Интервал = ЗначениеДГ.Добавить();
	Интервал.Начало = Стр.ДатаНачала;
	Интервал.Конец = Стр.ДатаОкончания;
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

