
Функция TelegramGet(Запрос)
	
	//Ответ = Новый HTTPСервисОтвет(200);
	//Ответ.УстановитьТелоИзСтроки("Tamara, You Need think more!!!");
	//Возврат ВКМ_Телеграм.ПолучитьЭлементСправочника();
	
КонецФункции


Функция PostMPost(Запрос)
	
	//УстановитьПривилегированныйРежим(Истина);
	
	//Попытка
		
		//РезультатОтправки = ВКМ_Телеграм.ВКМ_ОтправкаСообщенийВТелеграм(РезультатТекста);
		//Ответ = Новый HTTPСервисОтвет(РезультатОтправки);
	//Исключение
	//	ИнформацияОбОшибке = ИнформацияОбОшибке();
	//	Ответ = ВКМ_Телеграм.ОтветОбОшибке(ИнформацияОбОшибке);
	//КонецПопытки;
	
	
	//Ответ = Новый HTTPСервисОтвет(200);
	//Ответ.УстановитьТелоИзСтроки("Tamara, You Need think more!!!");
	//Возврат Ответ;
	
		
	//Возврат ВКМ_Телеграм.ПолучитьЭлементСправочника();
КонецФункции

